In [10]:
import pandas as pd
df1 = pd.DataFrame({
    'city': ["New york", "Chicago", "san fransico"],
    'temperature': [25, 10, 27],
    
})
df1

           city  temperature
0      New york           25
1       Chicago           10
2  san fransico           27

In [11]:
df2 = pd.DataFrame({
    'city': ["New york", "Chicago", "orlando", "Baltimore"],
    'humidity': [80, 76, 65, 35],
    
})
df2

        city  humidity
0   New york        80
1    Chicago        76
2    orlando        65
3  Baltimore        35

In [12]:
df3 = pd.merge(df1, df2, on = 'city')

In [13]:
df3

       city  temperature  humidity
0  New york           25        80
1   Chicago           10        76

In [14]:
df3 = pd.merge(df1, df2, on = 'city', how = 'outer')

In [15]:
df3

           city  temperature  humidity
0      New york         25.0      80.0
1       Chicago         10.0      76.0
2  san fransico         27.0       NaN
3       orlando          NaN      65.0
4     Baltimore          NaN      35.0

In [17]:
df1 = pd.DataFrame({
    'city': ["New york", "Chicago", "san fransico"],
    'temperature': [25, 10, 27],
    'humidity': [80, 76, 65]
    
})
df1

           city  temperature  humidity
0      New york           25        80
1       Chicago           10        76
2  san fransico           27        65

In [18]:
df2 = pd.DataFrame({
    'city': ["New york", "Chicago", "san fransico"],
    'temperature': [28, 11, 17],
    'humidity': [80, 76, 65]
    
})
df2

           city  temperature  humidity
0      New york           28        80
1       Chicago           11        76
2  san fransico           17        65

In [19]:
df = pd.merge(df1, df2, on = 'city')

In [28]:
df

           city  temperature_x  humidity_x  temperature_y  humidity_y
0      New york             25          80             28          80
1       Chicago             10          76             11          76
2  san fransico             27          65             17          65

In [32]:
df = pd.merge(df1, df2, on = 'city', suffixes =('_left', '_right'))
df

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,New york,25,80,28,80
1,Chicago,10,76,11,76
2,san fransico,27,65,17,65